devdnl/dnx-rtos/src/system/drivers/i2c/stm32f4/i2c_lld.c
                return err;

        } else {
                sys_critical_section_begin();
                {
                        if (!write && (count == 2)) {
                                SET_BIT(i2c->CR1, I2C_CR1_POS | I2C_CR1_ACK);
                        }

                        u16_t tmp = i2c->SR1;
                        i2c->DR   = write ? (hdl->config.address & 0xFE) : (hdl->config.address | 0x01);
                        (void)tmp;
                }
                sys_critical_section_end();

                int err =  wait_for_event_poll(hdl, I2C_SR1_ADDR, _I2C_TIMEOUT_BYTE_TRANSFER);
                if (err) {
                        printk("I2C%d:%d send 7-bit address error", hdl->major, hdl->minor);
                }

                return err;
        }
}

//==============================================================================
/**
 * @brief  Function receive bytes from I2C bus (master-receiver)
 * @param  hdl                  device handle
 * @param  dst                  destination buffer
 * @param  count                number of bytes to receive
 * @param  rdcnt                number of read bytes
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__receive(I2C_dev_t *hdl, u8_t *dst, size_t count, size_t *rdcnt)
{
        int      err = EIO;
        ssize_t  n   = 0;
        I2C_t   *i2c = get_I2C(hdl);

        if (count >= 3) {
#if USE_DMA > 0
                if (I2C_HW[hdl->major].use_DMA) {
                        u32_t dmad = _DMA_DDI_reserve(0, I2C_HW[hdl->major].DMA_rx_stream_pri);
                        if (dmad == 0) {
                                dmad = _DMA_DDI_reserve(0, I2C_HW[hdl->major].DMA_rx_stream_alt);
                        }

                        if (dmad) {
                                CLEAR_BIT(i2c->CR2, I2C_CR2_ITBUFEN | I2C_CR2_ITERREN | I2C_CR2_ITEVTEN);

                                _DMA_DDI_config_t config;
                                config.arg      = _I2C[hdl->major];
                                config.callback = DMA_callback;
                                config.release  = false;
                                config.PA       = cast(u32_t, &i2c->DR);
                                config.MA[0]    = cast(u32_t, dst);
                                config.NDT      = count;
                                config.FC       = DMA_SxFCR_FTH_0 | DMA_SxFCR_FS_2;
                                config.CR       = ((I2C_HW[hdl->major].DMA_channel & 7) << DMA_SxCR_CHSEL_Pos)
                                                | DMA_SxCR_MINC;
                                config.IRQ_priority = __CPU_DEFAULT_IRQ_PRIORITY__;

                                err = _DMA_DDI_transfer(dmad, &config);
                                if (!err) {
                                        SET_BIT(i2c->CR2, I2C_CR2_LAST | I2C_CR2_DMAEN);
                                        clear_address_event(hdl);

                                        err = wait_for_event_DMA(hdl);
                                        if (!err) {
                                                n = count;
                                        } else {
                                                printk("I2C: DMA Rx event error");
                                        }
                                } else {
                                        printk("I2C: DMA receive error");
                                }

                                _DMA_DDI_release(dmad);
                                goto finish;
                        } else {
                                printk("I2C: DMA read channel in use, using polling mode");
                        }
                }
#endif
                {
                        clear_address_event(hdl);

                        while (count) {
                                if (count == 3) {
                                        err = wait_for_event_poll(hdl, I2C_SR1_RXNE, _I2C_TIMEOUT_BYTE_TRANSFER);
                                        if (err) break;

                                        err = wait_for_event_poll(hdl, I2C_SR1_BTF, _I2C_TIMEOUT_BYTE_TRANSFER);
                                        if (err) break;

                                        sys_critical_section_begin();
                                        {
                                                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                                                *dst++ = i2c->DR;
                                                n++;

                                                SET_BIT(i2c->CR1, I2C_CR1_STOP);

                                                *dst++ = i2c->DR;
                                                n++;
                                        }
                                        sys_critical_section_end();

                                        err = wait_for_event_poll(hdl, I2C_SR1_RXNE, _I2C_TIMEOUT_BYTE_TRANSFER);
                                        if (err) break;

                                        *dst++ = i2c->DR;
                                        n++;

                                        count = 0;
                                } else {
                                        err = wait_for_event_poll(hdl, I2C_SR1_RXNE, _I2C_TIMEOUT_BYTE_TRANSFER);
                                        if (!err) {
                                                sys_critical_section_begin();
                                                {
                                                        int cnt = 0;

                                                        while ((i2c->SR1 & I2C_SR1_RXNE) && (count > 3) && (cnt < 2)) {
                                                                *dst++ = i2c->DR;
                                                                count--;
                                                                n++;
                                                                cnt++;
                                                        }
                                                }
                                                sys_critical_section_end();
                                        } else {
                                                break;
                                        }
                                }
                        }
                }

        } else if (count == 2) {
                sys_critical_section_begin();
                {
                        clear_address_event(hdl);
                        CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                }
                sys_critical_section_end();

                err = wait_for_event_poll(hdl, I2C_SR1_BTF, _I2C_TIMEOUT_BYTE_TRANSFER);
                if (!err) {
                        sys_critical_section_begin();
                        {
                                CLEAR_BIT(i2c->CR1, I2C_CR1_POS);
                                SET_BIT(i2c->CR1, I2C_CR1_STOP);
                        }
                        sys_critical_section_end();

                        *dst++ = i2c->DR;
                        *dst++ = i2c->DR;
                        n     += 2;
                        count  = 0;
                }

